app/Controllers/Company.php

    public function index()
    {
        $model = model(CompanyModel::class);

        $perPage = $this->request->getVar('perPage') ?? 10;
        $page = $this->request->getVar('page') ?? 1;

        $type = $this->request->getVar('type');
        $search = $this->request->getVar('search');

        $companies = null;

        if (isset($type) && isset($search)) {
            $companies = $model->select('*')
                ->where([$type => $search])
                ->paginate($perPage, 'default', $page);
        } else {
            $companies = $model->paginate($perPage, 'default', $page);
---
SELECT *
FROM `companies`
 LIMIT 500, 10
SELECT COUNT(*) AS `numrows`
FROM `companies`

    public function edit($id) {

        $model = model(CompanyModel::class);

        if ($this->request->getMethod() == 'post') {

            $id = $this->request->getPost('id');
            $name = $this->request->getPost('name');
            $nit = $this->request->getPost('nit');
            $nrc = $this->request->getPost('nrc');
            $city = $this->request->getPost('city');

            $data = [
                'name' => $name,
                'nit' => $nit,
                'nrc' => $nrc,
                'city' => $city,
            ];

            if ($model->update($id, $data) === false) {
                $data['id'] = $id;
                return view('companies/edit', ['errors' => $model->errors(), 'company' => $data]);
            }

            return redirect()->to('/companies')
                ->with('type', 'info')
                ->with('msg', 'Updated successfully');
        }

        $company =  $model->find($id);
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = '504'